tutorials/combustion/fireFoam/les/oppositeBurningPanels/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    ground
    {
        type            wall;
        nFaces          192;
        startFace       424628;
    }
    sides
    {
        type            patch;
        nFaces          8216;
        startFace       424820;
    }
    top
    {
        type            patch;
        nFaces          384;
        startFace       433036;
    }
    region0_to_panelRegion_fRight_zone
    {
        type            mappedWall;
        nFaces          3408;
        startFace       433420;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_fRight_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
3408
(
(0 -3.469446952e-18 0)
(-5.551115123e-17 -1.387778781e-17 5.551115123e-17)
(0 1.387778781e-17 0)
(0 -1.387778781e-17 5.551115123e-17)
(0 2.775557562e-17 0)
(0 -2.775557562e-17 0)
(-2.775557562e-17 2.775557562e-17 5.551115123e-17)
(-2.775557562e-17 0 5.551115123e-17)
...
)
;
    }
    region0_to_panelRegion_fLeft_zone
    {
        type            mappedWall;
        nFaces          3408;
        startFace       436828;
        sampleMode      nearestPatchFace;
        sampleRegion    panelRegion;
        samplePatch     region0_to_panelRegion_fLeft_zone;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
3408
(
(0 1.734723476e-18 0)
(0 3.469446952e-18 -1.387778781e-17)
(8.326672685e-17 -1.040834086e-17 1.387778781e-17)
(2.775557562e-17 -6.938893904e-18 0)
(2.775557562e-17 -2.081668171e-17 6.938893904e-18)
(0 0 2.775557562e-17)
(0 2.775557562e-17 -6.938893904e-18)
(2.775557562e-17 -1.387778781e-17 6.938893904e-18)
...
)
;
    }
    burner
    {
        type            patch;
        nFaces          768;
        startFace       440236;
    }
)

// ************************************************************************* //
